Основные_объекты_КР/src/Documents/ЗаявкаНаТранспорт/ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаТранспорт</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.МестоположенияБригад</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЭтапДоставки</name>
    <type>
      <types>EnumRef.ЭтапыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Километраж</name>
    <comment>Расстояние в км. туда и обратно</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Основные_объекты_КР/src/InformationRegisters/СформированныеБригады/СформированныеБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СформированныеБригады</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ПервыйГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ВторойГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>НачальноеЗначениеСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Машина</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_КР/src/Documents/ЗаявкаНаТранспорт/Forms/ФормаДокументаУправляемая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) = Ложь Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ 'Заявка на транспорт' вводится только на основании 'Расходной накладной'.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	СуммаПокупки = Объект.ДокументОснование.СуммаПоДокументу;
	
	ПороговаяСумма = Константы.СуммаПокупкиДляБесплатнойДоставки.Получить();
	
	ПороговаяСумма = ?(ПороговаяСумма <= 0, 1000, ПороговаяСумма);
	
	Если СуммаПокупки < ПороговаяСумма Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Суммы покупки недостаточно для оформления бесплатной доставки.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура МашинаПриИзменении(Элемент)
	
	ПолучитьДанныеПоБригаде();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоБригаде()
	
	Если ЗначениеЗаполнено(Объект.Машина) = Ложь Тогда
		
		Объект.Водитель = Справочники.Сотрудники.ПустаяСсылка();
		Объект.ПервыйГрузчик = Справочники.Сотрудники.ПустаяСсылка();
		Объект.ВторойГрузчик = Справочники.Сотрудники.ПустаяСсылка();
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Водитель,
	|	ПервыйГрузчик,
	|	ВторойГрузчик
	|ИЗ
	|	РегистрСведений.СформированныеБригады
	|ГДЕ
	|	Период = &НачалоДняДатыДокумента И
	|	Машина = &ВыбраннаяМашина
	|";
	
	Запрос.УстановитьПараметр("НачалоДняДатыДокумента", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ВыбраннаяМашина", Объект.Машина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("На " + Формат(Объект.Дата, "ДЛФ=DD") + " к выбранной машине не прикреплена бригада.");
		
		Объект.Машина = Справочники.ТранспортныеСредства.ПустаяСсылка();
		
		Объект.Водитель = Справочники.Сотрудники.ПустаяСсылка();
		Объект.ПервыйГрузчик = Справочники.Сотрудники.ПустаяСсылка();
		Объект.ВторойГрузчик = Справочники.Сотрудники.ПустаяСсылка();
		
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Объект.Водитель = Выборка.Водитель;
	Объект.ПервыйГрузчик = Выборка.ПервыйГрузчик;
	Объект.ВторойГрузчик = Выборка.ВторойГрузчик;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Элементы.СотрудникТранспортногоОтдела.Доступность = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры
